# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'gh'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh-autosuggestions'
brew 'stripe/stripe-cli/stripe'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'

# Apps
cask 'alfred'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'warp'
cask 'insomnia'
cask 'keepassxc'
cask 'phpstorm'
cask 'sequel-ace'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'zoom'
cask 'topnotch'
cask 'bartender'
cask 'herd'
cask 'loom'

# SOC 2 Compliance
cask 'avast-security'
cask 'drata-agent'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'ColorSlurp', id: 1287239339